================================================================================
Section titles with different levels
================================================================================

= Level 1 Section
== Level 2 Section
=== Level 3 Section
==== Level 4 Section
===== Level 5 Section
====== Level 6 Section

--------------------------------------------------------------------------------

(source_file
  (section
    (section_title (title))
    (section
      (section_title (title))
      (section
        (section_title (title))
        (section
          (section_title (title))
          (section
            (section_title (title))
            (section
              (section_title (title)))))))))

================================================================================
Single section with title
================================================================================

= Document Title

--------------------------------------------------------------------------------

(source_file
  (section
    (section_title (title))))

================================================================================
Section titles with varied spacing
================================================================================

=  Title with two spaces
==   Title with three spaces
===	Title with tab

--------------------------------------------------------------------------------

(source_file
  (section
    (section_title (title))
    (section
      (section_title (title))
      (section
        (section_title (title))))))
