================================================================================
Paragraphs with blank lines
================================================================================

This is a paragraph line 1
This is still the same paragraph line 2

This is a different paragraph
on multiple lines


Another paragraph after multiple blank lines

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment))))

================================================================================
Fake headings without space should be paragraphs
================================================================================

==NotAHeading because no space
===NotAHeadingEither
====== Also not a heading

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment)))
  (section
    (section_title
      (title))))

================================================================================
Mixed paragraphs and blank lines
================================================================================

First paragraph

==Not a heading

Second paragraph
continues here

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment))))

================================================================================
Single paragraph line
================================================================================

Just one line

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment))))
