================================================================================
Basic attribute entries
================================================================================

:revnumber: 1.2.3
:author: Alice

= Title
:role: admin

Some text.

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    name: (name)
    value: (value))
  (attribute_entry
    name: (name)
    value: (value))
  (section
    (section_title
      (title))
    (attribute_entry
      name: (name)
      value: (value)))
  (paragraph
    content: (text_with_inlines
      (text_segment))))

================================================================================
Attribute entries without values
================================================================================

:imagesdir:
:source-highlighter:

= Document

Content here

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    name: (name))
  (attribute_entry
    name: (name))
  (section
    (section_title
      (title)))
  (paragraph
    content: (text_with_inlines
      (text_segment))))

================================================================================
Attribute entries with spaces in values
================================================================================

:title: My Great Document
:description: This is a long description with spaces

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    name: (name)
    value: (value))
  (attribute_entry
    name: (name)
    value: (value)))

================================================================================
Invalid attribute patterns should be paragraphs
================================================================================

: missing name
:incomplete because no colon
:: starts with double colon

--------------------------------------------------------------------------------

(source_file
  (paragraph
    content: (text_with_inlines
      (text_colon)
      (text_segment)))
  (paragraph
    content: (text_with_inlines
      (text_colon)
      (text_segment)))
  (paragraph
    content: (text_with_inlines
      (text_colon)
      (text_colon)
      (text_segment))))

================================================================================
Mixed attributes and other content
================================================================================

:author: Bob

First paragraph

:version: 2.0

= Section Title

More content

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    name: (name)
    value: (value))
  (paragraph
    content: (text_with_inlines
      (text_segment)))
  (attribute_entry
    name: (name)
    value: (value))
  (section
    (section_title
      (title)))
  (paragraph
    content: (text_with_inlines
      (text_segment))))
