================================================================================
Basic attribute entries
================================================================================

:revnumber: 1.2.3
:author: Alice

= Title
:role: admin

Some text.

--------------------------------------------------------------------------------

(source_file
  (attribute_entry (name) (value))
  (attribute_entry (name) (value))
  (section
    (section_title (title))
    (attribute_entry (name) (value))
    (paragraph (text))))

================================================================================
Attribute entries without values
================================================================================

:imagesdir:
:source-highlighter:

= Document

Content here

--------------------------------------------------------------------------------

(source_file
  (attribute_entry (name))
  (attribute_entry (name))
  (section
    (section_title (title))
    (paragraph (text))))

================================================================================
Attribute entries with spaces in values
================================================================================

:title: My Great Document
:description: This is a long description with spaces

--------------------------------------------------------------------------------

(source_file
  (attribute_entry (name) (value))
  (attribute_entry (name) (value)))

================================================================================
Invalid attribute patterns should be paragraphs
================================================================================

: missing name
:incomplete because no colon
:: starts with double colon

--------------------------------------------------------------------------------

(source_file
  (paragraph (text))
  (paragraph (text))
  (paragraph (text)))

================================================================================
Mixed attributes and other content
================================================================================

:author: Bob

First paragraph

:version: 2.0

= Section Title

More content

--------------------------------------------------------------------------------

(source_file
  (attribute_entry (name) (value))
  (paragraph (text))
  (attribute_entry (name) (value))
  (section
    (section_title (title))
    (paragraph (text))))
