================================================================================
Basic attribute entries
================================================================================

:revnumber: 1.2.3
:author: Alice

= Title
:role: admin

Some text.

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    (attribute_value))
  (attribute_entry
    (attribute_value))
  (section
    (section_level_1
      (section_marker_1)
      (title)
      (attribute_entry
        (attribute_value))
      (paragraph

================================================================================
Attribute entries without values
================================================================================

:imagesdir:
:source-highlighter:

= Document

Content here

--------------------------------------------------------------------------------

(source_file
  (attribute_entry)
  (attribute_entry)
  (section
    (section_level_1
      (section_marker_1)
      (title)
      (paragraph

================================================================================
Attribute entries with spaces in values
================================================================================

:title: My Great Document
:description: This is a long description with spaces

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    (attribute_value))
  (attribute_entry
    (attribute_value)))

================================================================================
Invalid attribute patterns should be paragraphs
================================================================================

: missing name
:incomplete because no colon
:: starts with double colon

--------------------------------------------------------------------------------

(source_file
  (paragraph
  (paragraph
  (paragraph

================================================================================
Mixed attributes and other content
================================================================================

:author: Bob

First paragraph

:version: 2.0

= Section Title

More content

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    (attribute_value))
  (paragraph
  (attribute_entry
    (attribute_value))
  (section
    (section_level_1
      (section_marker_1)
      (title)
      (paragraph
