================================================================================
Basic attribute entries
================================================================================

:revnumber: 1.2.3
:author: Alice

= Title
:role: admin

Some text.

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    (attribute_name
      (PLAIN_COLON))
    (attribute_identifier)
    (attribute_name
      (PLAIN_COLON))
    (attribute_value))
  (attribute_entry
    (attribute_name
      (PLAIN_COLON))
    (attribute_identifier)
    (attribute_name
      (PLAIN_COLON))
    (attribute_value))
  (section
    (section_level_1
      (section_marker_1)
      (title)
      (attribute_entry
        (attribute_name
          (PLAIN_COLON))
        (attribute_identifier)
        (attribute_name
          (PLAIN_COLON))
        (attribute_value))
      (paragraph
        (inline_seq_nonempty
          (plain_text)
          (plain_text))))))

================================================================================
Attribute entries without values
================================================================================

:imagesdir:
:source-highlighter:

= Document

Content here

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    (attribute_name
      (PLAIN_COLON))
    (attribute_identifier)
    (attribute_name
      (PLAIN_COLON)))
  (attribute_entry
    (attribute_name
      (PLAIN_COLON))
    (attribute_identifier)
    (attribute_name
      (PLAIN_COLON)))
  (section
    (section_level_1
      (section_marker_1)
      (title)
      (paragraph
        (inline_seq_nonempty
          (plain_text)
          (plain_text))))))

================================================================================
Attribute entries with spaces in values
================================================================================

:title: My Great Document
:description: This is a long description with spaces

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    (attribute_name
      (PLAIN_COLON))
    (attribute_identifier)
    (attribute_name
      (PLAIN_COLON))
    (attribute_value))
  (attribute_entry
    (attribute_name
      (PLAIN_COLON))
    (attribute_identifier)
    (attribute_name
      (PLAIN_COLON))
    (attribute_value)))

================================================================================
Invalid attribute patterns should be paragraphs
================================================================================

: missing name
:incomplete because no colon
:: starts with double colon

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline_seq_nonempty
      (plain_colon
        (PLAIN_COLON)))
    (ERROR
      (attribute_identifier)
      (attribute_identifier))
    (inline_seq_nonempty
      (plain_colon
        (PLAIN_COLON))
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text))
    (inline_seq_nonempty
      (plain_colon
        (PLAIN_COLON))
      (plain_colon
        (PLAIN_COLON))
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text))))

================================================================================
Mixed attributes and other content
================================================================================

:author: Bob

First paragraph

:version: 2.0

= Section Title

More content

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    (attribute_name
      (PLAIN_COLON))
    (attribute_identifier)
    (attribute_name
      (PLAIN_COLON))
    (attribute_value))
  (paragraph
    (inline_seq_nonempty
      (plain_text)
      (plain_text)))
  (attribute_entry
    (attribute_name
      (PLAIN_COLON))
    (attribute_identifier)
    (attribute_name
      (PLAIN_COLON))
    (attribute_value))
  (section
    (section_level_1
      (section_marker_1)
      (title)
      (paragraph
        (inline_seq_nonempty
          (plain_text)
          (plain_text))))))
