================================================================================
Indented headings are treated as valid headings
================================================================================

  == Indented level 1
   == Indented level 2
	=== Indented with tab

--------------------------------------------------------------------------------

(source_file
  (section
    (section_level_2
      marker: (section_marker_2)
      title: (title)))
  (section
    (section_level_2
      marker: (section_marker_2)
      title: (title)
      content: (section_level_3
        marker: (section_marker_3)
        title: (title)))))

================================================================================
Invalid attribute patterns should be paragraphs
================================================================================

: missing name after colon
:incomplete-because-no-second-colon
:: double colon start
::: triple colon

--------------------------------------------------------------------------------

(source_file
  (paragraph
    content: (inline_seq_nonempty
      (plain_colon)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_colon)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_dash)
      (plain_dash)
      (plain_dash)
      (plain_dash)
      (plain_dash)
      (plain_dash)
      (plain_dash)
      (plain_dash)
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_colon)
      (plain_colon)
      (plain_text)
      (plain_text)
      (plain_text)))
  (description_list
    items: (description_item
      term: (description_term
        (plain_colon))
      delimiter: (description_delimiter
        (description_delimiter)
        (description_delimiter))
      details: (description_content
        (inline_seq_nonempty
          (plain_text)
          (plain_text))))))

================================================================================
Attributes with spaces in values and empty values
================================================================================

== Attribute Cases
:nameValue:    value with spaces
:emptyCase:
:spacedValue: 	tabbed value

--------------------------------------------------------------------------------

(source_file
  (section
    (section_level_2
      marker: (section_marker_2)
      title: (title)
      content: (attribute_entry
        name: (attribute_name
          (plain_colon)
          (plain_text)
          (plain_colon))
        value: (attribute_value))
      content: (attribute_entry
        name: (attribute_name
          (plain_colon)
          (plain_text)
          (plain_colon)))
      content: (attribute_entry
        name: (attribute_name
          (plain_colon)
          (plain_text)
          (plain_colon))
        value: (attribute_value)))))

================================================================================
Multiple consecutive blank lines
================================================================================

First paragraph


Second paragraph after two blanks



Third paragraph after three blanks

--------------------------------------------------------------------------------

(source_file
  (paragraph
    content: (inline_seq_nonempty
      (plain_text)
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text))))

================================================================================
Headings with trailing spaces
================================================================================

== Title with trailing spaces
== Another with tabs
=== Mix of spaces and content   text here

--------------------------------------------------------------------------------

(source_file
  (section
    (section_level_2
      marker: (section_marker_2)
      title: (title)))
  (section
    (section_level_2
      marker: (section_marker_2)
      title: (title)
      content: (section_level_3
        marker: (section_marker_3)
        title: (title)))))
