================================================================================
Indented headings are treated as valid headings
================================================================================

  = Indented level 1
   == Indented level 2
	=== Indented with tab

--------------------------------------------------------------------------------

(source_file
  (section
    (section_title
      (title))
    (section
      (section_title
        (title))
      (section
        (section_title
          (title))))))

================================================================================
Invalid attribute patterns should be paragraphs
================================================================================

: missing name after colon
:incomplete-because-no-second-colon
:: double colon start
::: triple colon

--------------------------------------------------------------------------------

(source_file
  (paragraph
    content: (text_with_inlines
      (text_colon)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)))
  (paragraph
    content: (text_with_inlines
      (text_colon)
      (text_segment)))
  (paragraph
    content: (text_with_inlines
      (text_colon)
      (text_colon)
      (text_segment)
      (text_segment)
      (text_segment)))
  (paragraph
    content: (text_with_inlines
      (text_colon)
      (text_colon)
      (text_colon)
      (text_segment)
      (text_segment))))

================================================================================
Attributes with spaces in values and empty values
================================================================================

:name:    value with spaces
:empty:
:spaced: 	tabbed value

--------------------------------------------------------------------------------

(source_file
  (attribute_entry
    (name)
    (value))
  (attribute_entry
    (name))
  (attribute_entry
    (name)
    (value)))

================================================================================
Multiple consecutive blank lines
================================================================================

First paragraph


Second paragraph after two blanks



Third paragraph after three blanks

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)))
  (paragraph
    (text_with_inlines
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment))))

================================================================================
Headings with trailing spaces
================================================================================

= Title with trailing spaces   
== Another with tabs	
=== Mix of spaces and content   text here

--------------------------------------------------------------------------------

(source_file
  (section
    (section_title
      (title))
    (section
      (section_title
        (title))
      (section
        (section_title
          (title))))))
