================================================================================
Simple unordered list with asterisk
================================================================================

* First item
* Second item
* Third item

--------------------------------------------------------------------------------

(source_file
  (unordered_list
    (unordered_list_item)
    (unordered_list_item)
    (unordered_list_item)))

================================================================================
Simple unordered list with hyphen
================================================================================

- First item
- Second item
- Third item

--------------------------------------------------------------------------------

(source_file
  (unordered_list
    (unordered_list_item)
    (unordered_list_item)
    (unordered_list_item)))

================================================================================
Mixed unordered list markers
================================================================================

* First item
- Second item
* Third item

--------------------------------------------------------------------------------

(source_file
  (unordered_list
    (unordered_list_item))
  (unordered_list
    (unordered_list_item))
  (unordered_list
    (unordered_list_item)))

================================================================================
Not a list - missing space after marker
================================================================================

*NotAList
-NotAList

--------------------------------------------------------------------------------

(source_file
  (paragraph (text))
  (paragraph (text)))
