================================================================================
Simple unordered list with asterisk
================================================================================

* First item
* Second item
* Third item

--------------------------------------------------------------------------------

(source_file
  (unordered_list
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))))

================================================================================
Simple unordered list with hyphen
================================================================================

- First item
- Second item
- Third item

--------------------------------------------------------------------------------

(source_file
  (unordered_list
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))))

================================================================================
Mixed unordered list markers
================================================================================

* First item
- Second item
* Third item

--------------------------------------------------------------------------------

(source_file
  (unordered_list
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))
    (unordered_list_item
      (text_with_inlines
        (text_segment)
        (text_segment)))))

================================================================================
Not a list - missing space after marker
================================================================================

*NotAList

-NotAList

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (inline_element
        (strong
          (strong_constrained
            (strong_text))))))
  (paragraph
    (text_with_inlines
      (text_segment))))
