================================================================================
Empty example block
================================================================================

====
====

---

(source_file
  (example_block
    open: (example_open)
    close: (example_close)))

====
This is example content
line 2
====

---

(source_file
  (example_block
    open: (example_open)
    content: (block_content
      (content_line)
      (content_line))
    close: (example_close)))

================================================================================
Listing block with content
================================================================================

----
def hello():
    print("Hello world")
line with ---- not at beginning
----

---

(source_file
  (listing_block
    open: (listing_open)
    content: (block_content
      (content_line)
      (content_line)
      (content_line))
    close: (MISSING listing_close))
  (paragraph
    content: (text_with_inlines
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment))))

================================================================================
Literal block with content
================================================================================

....
  Preserves
    whitespace
    exactly
....

---

(source_file
  (literal_block
    open: (literal_open)
    content: (block_content
      (content_line)
      (content_line)
      (content_line))
    close: (literal_close)))

================================================================================
Quote block with content
================================================================================

____
"The best way to find out if you can trust somebody is to trust them."
-- Ernest Hemingway
____

---

(source_file
  (quote_block
    (quote_open)
    (block_content
      (content_line)
      (content_line))
    (quote_close)))

================================================================================
Sidebar block with content
================================================================================

****
This is sidebar content.
It's displayed separately from main text.
****

---

(source_file
  (sidebar_block
    (sidebar_open)
    (block_content
      (content_line)
      (content_line))
    (sidebar_close)))

================================================================================
Passthrough block with content
================================================================================

++++
<div class="custom">
Raw HTML content
</div>
++++

---

(source_file
  (passthrough_block
    (passthrough_open)
    (block_content
      (content_line)
      (content_line)
      (content_line))
    (passthrough_close)))

================================================================================
Open block with content
================================================================================

--
This is an open block.
Can contain any content.
--

---

(source_file
  (open_block
    open: (openblock_open)
    content: (block_content
      (content_line)
      (content_line))
    close: (openblock_close)))

====
System.out.println("Hello");
====

---

(source_file
  (example_block
    open: (example_open)
    content: (block_content
      (content_line))
    close: (example_close)))

====
Example content in section
====

---

(source_file
  (example_block
    open: (example_open)
    content: (block_content
      (content_line))
    close: (example_close)))

====
This is an example block
====

---

(source_file
  (example_block
    open: (example_open)
    content: (block_content
      (content_line))
    close: (example_close)))

================================================================================
Block with trailing spaces on delimiters
================================================================================

____    
Quote content
____    

---

(source_file
  (quote_block
    (quote_open)
    (block_content
      (content_line))
    (quote_close)))

================================================================================
Content with near-delimiters not at beginning of line
================================================================================

....
Line with .... not at beginning
Also a line with....suffix
....

---

(source_file
  (literal_block
    open: (literal_open)
    content: (block_content
      (content_line)
      (content_line))
    close: (literal_close)))

================================================================================
Open block with nested-looking delimiters
================================================================================

--
Content with -- not on its own line
Another -- delimiter
--

---

(source_file
  (open_block
    open: (openblock_open)
    content: (block_content
      (content_line)
      (content_line))
    close: (openblock_close)))

====
Example block
====

----
Listing block
----

(source_file
  (example_block
    open: (example_open)
    content: (block_content
      (content_line))
    close: (example_close))
  (listing_block
    open: (listing_open)
    close: (MISSING listing_close))
  (paragraph
    content: (text_with_inlines
      (text_segment)
      (text_segment))))
