================================================================================
Empty example block
================================================================================

====
====

---

(source_file
  (example_block
    open: (example_open
      (EXAMPLE_FENCE_START))
    close: (example_close
      (EXAMPLE_FENCE_END))))

====
This is example content
line 2
====

---

(source_file)

================================================================================
Listing block with content
================================================================================

----
def hello():
    print("Hello world")
line with ---- not at beginning
----

(source_file
  (listing_block
    open: (listing_open
      (LISTING_FENCE_START))
    content: (block_content
      (content_line)
      (content_line)
      (content_line))
    close: (listing_close
      (MISSING LISTING_FENCE_END)))
  (paragraph
    content: (text_with_inlines
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment))))

================================================================================
Literal block with content
================================================================================

....
  Preserves
    whitespace
    exactly
....

---

(source_file
  (literal_block
    open: (literal_open
      (LITERAL_FENCE_START))
    content: (block_content
      (content_line)
      (content_line)
      (content_line))
    close: (literal_close
      (LITERAL_FENCE_END))))

================================================================================
Quote block with content
================================================================================

____
"The best way to find out if you can trust somebody is to trust them."
-- Ernest Hemingway
____

---

(source_file
  (quote_block
    (quote_open
      (QUOTE_FENCE_START))
    (block_content
      (content_line)
      (content_line))
    (quote_close
      (QUOTE_FENCE_END))))

================================================================================
Sidebar block with content
================================================================================

****
This is sidebar content.
It's displayed separately from main text.
****

---

(source_file
  (sidebar_block
    (sidebar_open
      (SIDEBAR_FENCE_START))
    (block_content
      (content_line)
      (content_line))
    (sidebar_close
      (SIDEBAR_FENCE_END))))

================================================================================
Passthrough block with content
================================================================================

++++
<div class="custom">
Raw HTML content
</div>
++++

---

(source_file
  (passthrough_block
    (passthrough_open
      (PASSTHROUGH_FENCE_START))
    (block_content
      (content_line)
      (content_line)
      (content_line))
    (passthrough_close
      (PASSTHROUGH_FENCE_END))))

================================================================================
Open block with content
================================================================================

--
This is an open block.
Can contain any content.
--

---

(source_file
  (open_block
    open: (openblock_open
      (OPENBLOCK_FENCE_START))
    content: (block_content
      (content_line)
      (content_line))
    close: (openblock_close
      (OPENBLOCK_FENCE_END))))

====
System.out.println("Hello");
====

---

(source_file)

====
Example content in section
====

---

(source_file)

====
This is an example block
====

---

(source_file)

================================================================================
Block with trailing spaces on delimiters
================================================================================

____    
Quote content
____    

---

(source_file
  (quote_block
    (quote_open
      (QUOTE_FENCE_START))
    (block_content
      (content_line))
    (quote_close
      (QUOTE_FENCE_END))))

================================================================================
Content with near-delimiters not at beginning of line
================================================================================

....
Line with .... not at beginning
Also a line with....suffix
....

---

(source_file
  (literal_block
    open: (literal_open
      (LITERAL_FENCE_START))
    content: (block_content
      (content_line)
      (content_line))
    close: (literal_close
      (LITERAL_FENCE_END))))

================================================================================
Open block with nested-looking delimiters
================================================================================

--
Content with -- not on its own line
Another -- delimiter
--

---

(source_file
  (open_block
    open: (openblock_open
      (OPENBLOCK_FENCE_START))
    content: (block_content
      (content_line)
      (content_line))
    close: (openblock_close
      (OPENBLOCK_FENCE_END))))

====
Example block
====

----
Listing block
----

(source_file
  (example_block
    open: (example_open
      (EXAMPLE_FENCE_START))
    content: (block_content
      (content_line))
    close: (example_close
      (EXAMPLE_FENCE_END)))
  (listing_block
    open: (listing_open
      (LISTING_FENCE_START))
    content: (block_content
      (content_line))
    close: (listing_close
      (MISSING LISTING_FENCE_END)))
  (paragraph
    content: (text_with_inlines
      (text_segment)
      (text_segment))))
