================================================================================
Empty example block
================================================================================

====
====

---

(source_file
  (example_block
    open: (example_open)
    close: (example_close)))

====
This is example content
line 2
====

---

(source_file)

================================================================================
Literal block with content
================================================================================

....
  Preserves
    whitespace
    exactly
....

---

(source_file
  (paragraph
    content: (inline_seq_nonempty
      (plain_dot)
      (plain_dot)
      (plain_dot)
      (plain_dot)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_dot)
      (plain_dot)
      (plain_dot)
      (plain_dot))))

================================================================================
AsciiDoc blockquote with content
================================================================================

____
"The best way to find out if you can trust somebody is to trust them."

-- Ernest Hemingway
____

---

(source_file
  (asciidoc_blockquote
    open: (asciidoc_blockquote_open)
    content: (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    close: (asciidoc_blockquote_close)))

================================================================================
Sidebar block with content
================================================================================

****
This is sidebar content.
It's displayed separately from main text.
****

---

(source_file
  (sidebar_block
    (sidebar_open)
    (paragraph
      (inline_seq_nonempty
        (plain_text)
        (plain_text)
        (plain_text)
        (plain_text)
        (plain_dot)))
    (paragraph
      (inline_seq_nonempty
        (plain_text)
        (plain_quote)
        (plain_text)
        (plain_text)
        (plain_text)
        (plain_text)
        (plain_text)
        (plain_text)
        (plain_dot)))
    (sidebar_close)))

================================================================================
Passthrough block with content
================================================================================

++++
<div class="custom">
Raw HTML content
</div>
++++

---

(source_file
  (passthrough_block
    (passthrough_open)
    (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    (passthrough_close)))

================================================================================
Open block with content
================================================================================

--
This is an open block.
Can contain any content.
--

---

(source_file
  (open_block
    open: (openblock_open)
    content: (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    close: (openblock_close)))

====
System.out.println("Hello");
====

---

(source_file)

====
Example content in section
====

---

(source_file)

====
This is an example block
====

---

(source_file)

================================================================================
Block with trailing spaces on delimiters
================================================================================

____
Quote content
____

---

(source_file
  (asciidoc_blockquote
    open: (asciidoc_blockquote_open)
    content: (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    close: (asciidoc_blockquote_close)))

================================================================================
Content with near-delimiters not at beginning of line
================================================================================

....
Line with .... not at beginning
Also a line with....suffix
....

---

(source_file
  (paragraph
    content: (inline_seq_nonempty
      (plain_dot)
      (plain_dot)
      (plain_dot)
      (plain_dot)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_text)
      (plain_text)
      (plain_dot)
      (plain_dot)
      (plain_dot)
      (plain_dot)
      (plain_text)
      (plain_text)
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_dot)
      (plain_dot)
      (plain_dot)
      (plain_dot)
      (plain_text)))
  (paragraph
    content: (inline_seq_nonempty
      (plain_dot)
      (plain_dot)
      (plain_dot)
      (plain_dot))))

================================================================================
Open block with nested-looking delimiters
================================================================================

--
Content with -- not on its own line
Another -- delimiter
--

---

(source_file
  (open_block
    open: (openblock_open)
    content: (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    close: (openblock_close)))
