====
This is a note block with example content.
====

---

(source_file)

================================================================================
TIP block with sidebar delimiters
================================================================================

[TIP]
****
This is a tip block with sidebar content.
Useful information here.
****

---

(source_file
  (sidebar_block
    (metadata
      (block_attributes))
    (sidebar_open
      (SIDEBAR_FENCE_START))
    (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    (sidebar_close
      (SIDEBAR_FENCE_END))))

================================================================================
IMPORTANT block with quote delimiters
================================================================================

[IMPORTANT]
____
"This is important quoted content."
-- Author
____

---

(source_file
  (asciidoc_blockquote
    (metadata
      (block_attributes))
    (asciidoc_blockquote_open
      (QUOTE_FENCE_START))
    (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    (asciidoc_blockquote_close
      (QUOTE_FENCE_END))))

================================================================================
WARNING block with listing delimiters
================================================================================

[WARNING]
----
echo "This command can be dangerous"
rm -rf /path/to/files
----

(source_file
  (listing_block
    (metadata
      (block_attributes))
    open: (listing_open
      (LISTING_FENCE_START))
    content: (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    close: (listing_close
      (LISTING_FENCE_END))))

================================================================================
CAUTION block with literal delimiters
================================================================================

[CAUTION]
....
  Be very careful
    with this
    literal content
....

---

(source_file
  (literal_block
    (metadata
      (block_attributes))
    (literal_open
      (LITERAL_FENCE_START))
    (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE))
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    (literal_close
      (LITERAL_FENCE_END))))

================================================================================
TIP block with metadata
================================================================================

[TIP]
.Helpful Tip
[#tip-id.highlight]
[source,bash]
----
  echo "This tip has multiple metadata lines"
----

(source_file
  (listing_block
    (metadata
      (block_attributes)
      (block_title)
      (block_attributes)
      (block_attributes))
    open: (listing_open
      (LISTING_FENCE_START))
    content: (block_content
      (content_line
        (DELIMITED_BLOCK_CONTENT_LINE)))
    close: (listing_close
      (LISTING_FENCE_END))))

====
This warning block has an anchor.
====

---

(source_file)

================================================================================
Not an admonition block - no delimited block following
================================================================================

[NOTE]
This should be parsed as a generic attribute list followed by paragraph.

---

(source_file
  (paragraph
    (metadata
      (block_attributes))
    (text_with_inlines
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment)
      (text_segment))))
