====
This is a note block with example content.
====

--------------------------------------------------------------------------------

(source_file)

================================================================================
TIP block with sidebar delimiters
================================================================================

[TIP]
****
This is a tip block with sidebar content.
Useful information here.
****

--------------------------------------------------------------------------------

(source_file
  (block_admonition
    type: (admonition_attribute
      (ATTRIBUTE_LIST_START))
    block: (sidebar_block
      open: (sidebar_open
        (SIDEBAR_FENCE_START))
      content: (block_content
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE))
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE)))
      close: (sidebar_close
        (SIDEBAR_FENCE_END)))))

================================================================================
IMPORTANT block with quote delimiters
================================================================================

[IMPORTANT]
____
"This is important quoted content."
-- Author
____

--------------------------------------------------------------------------------

(source_file
  (block_admonition
    type: (admonition_attribute
      (ATTRIBUTE_LIST_START))
    block: (asciidoc_blockquote
      open: (asciidoc_blockquote_open
        (QUOTE_FENCE_START))
      content: (block_content
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE))
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE)))
      close: (asciidoc_blockquote_close
        (QUOTE_FENCE_END)))))

================================================================================
WARNING block with listing delimiters
================================================================================

[WARNING]
----
echo "This command can be dangerous"
rm -rf /path/to/files
----

--------------------------------------------------------------------------------

(source_file
  (block_admonition
    type: (admonition_attribute
      (ATTRIBUTE_LIST_START))
    block: (listing_block
      open: (listing_open
        (LISTING_FENCE_START))
      content: (block_content
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE))
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE)))
      close: (listing_close
        (LISTING_FENCE_END)))))

================================================================================
CAUTION block with literal delimiters
================================================================================

[CAUTION]
....
  Be very careful
    with this
    literal content
....

--------------------------------------------------------------------------------

(source_file
  (block_admonition
    type: (admonition_attribute
      (ATTRIBUTE_LIST_START))
    block: (literal_block
      open: (literal_open
        (LITERAL_FENCE_START))
      content: (block_content
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE))
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE))
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE)))
      close: (literal_close
        (LITERAL_FENCE_END)))))

================================================================================
TIP block with metadata
================================================================================

[TIP]
.Helpful Tip
[#tip-id.highlight]
[source,bash]
----
  echo "This tip has multiple metadata lines"
----

--------------------------------------------------------------------------------

(source_file
  (paragraph
    metadata: (metadata
      attributes: (block_attributes
        (ATTRIBUTE_LIST_START)))
    content: (inline_seq_nonempty
      (plain_text)
      (plain_text)))
  (block_admonition
    type: (admonition_attribute
      (ATTRIBUTE_LIST_START))
    block: (listing_block
      metadata: (metadata
        attributes: (block_attributes
          (ATTRIBUTE_LIST_START)))
      open: (listing_open
        (LISTING_FENCE_START))
      content: (block_content
        (content_line
          (DELIMITED_BLOCK_CONTENT_LINE)))
      close: (listing_close
        (LISTING_FENCE_END)))))

====
This warning block has an anchor.
====

--------------------------------------------------------------------------------

(source_file)

================================================================================
Not an admonition block - no delimited block following
================================================================================

[NOTE]
This should be parsed as a generic attribute list followed by paragraph.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (metadata
      (block_attributes
        (ATTRIBUTE_LIST_START)))
    (inline_seq_nonempty
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text)
      (plain_text))))
