================================================================================
Triple plus passthrough
================================================================================

This +++*should not be bold*+++ text.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_segment)
    (inline_element
      (passthrough_triple_plus))
    (text_segment)))

================================================================================
Pass macro without substitutions
================================================================================

This pass:[*should not be bold*] text.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_segment)
    (inline_element
      (pass_macro))
    (text_segment)))

================================================================================
Pass macro with substitutions
================================================================================

This pass:quotes[*should not be bold*] text.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_segment)
    (inline_element
      (pass_macro))
    (text_segment)))

================================================================================
Multiple passthrough in same line
================================================================================

Both +++raw+++ and pass:[protected] here.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_segment)
    (text_segment)
    (text_segment)
    (inline_element
      (pass_macro))
    (text_segment)))
