================================================================================
Triple plus passthrough
================================================================================

This +++*should not be bold*+++ text.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)
      (inline_element
        (passthrough_triple_plus))
      (text_segment))))

================================================================================
Pass macro without substitutions
================================================================================

This pass:[*should not be bold*] text.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)
      (text_colon)
      (text_bracket)
      (inline_element
        (strong
          (strong_constrained
            (strong_open)
            (strong_text)
            (strong_close))))
      (text_segment))))

================================================================================
Pass macro with substitutions
================================================================================

This pass:quotes[*should not be bold*] text.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)
      (text_colon)
      (text_segment)
      (text_bracket)
      (inline_element
        (strong
          (strong_constrained
            (strong_open)
            (strong_text)
            (strong_close))))
      (text_segment))))

================================================================================
Multiple passthrough in same line
================================================================================

Both +++raw+++ and pass:[protected] here.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)
      (inline_element
        (passthrough_triple_plus))
      (text_segment)
      (text_colon)
      (text_bracket)
      (text_segment))))
