================================================================================
Basic block comment
================================================================================

Before comment.

////
This is a block comment.
////

After comment.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)))
  (block_comment
    (comment_line))
  (paragraph
    (text_with_inlines
      (text_segment))))

================================================================================
Multi-line block comment with special characters
================================================================================

Normal paragraph.

////
Empty lines are preserved in comments:

Even with multiple empty lines

And special characters: //, ===, **bold**, `code`, {attr}
////

Another paragraph.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)))
  (block_comment
    (comment_line)
    (comment_line)
    (comment_line)
    (comment_line)
    (comment_line))
  (paragraph
    (text_with_inlines
      (text_segment))))

================================================================================
Single line block comment
================================================================================

Before.

////
Single line comment
////

After.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)))
  (block_comment
    (comment_line))
  (paragraph
    (text_with_inlines
      (text_segment))))

================================================================================
Multiple block comments
================================================================================

First paragraph.

////
First block comment
////

Second paragraph.

////
Second block comment
with multiple lines
////

Third paragraph.

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text_with_inlines
      (text_segment)))
  (block_comment
    (comment_line))
  (paragraph
    (text_with_inlines
      (text_segment)))
  (block_comment
    (comment_line)
    (comment_line))
  (paragraph
    (text_with_inlines
      (text_segment))))

================================================================================
Block comments with sections
================================================================================

= Document Title

////
Comment before section
////

== Section Header

Content paragraph.

////
Comment after section
////

More content.

--------------------------------------------------------------------------------

(source_file
  (section
    (section_title
      (title)))
  (block_comment
    (comment_line))
  (section
    (section_title
      (title)))
  (paragraph
    (text_with_inlines
      (text_segment)))
  (block_comment
    (comment_line))
  (paragraph
    (text_with_inlines
      (text_segment))))

================================================================================
Block comments with nested delimited block markers
================================================================================

////
Nested //// markers should not break parsing
And other delimited block markers like ---- or ====
Are just regular text inside comments
Even code blocks like ``` don't interfere
////

Final paragraph.

--------------------------------------------------------------------------------

(source_file
  (block_comment
    (comment_line)
    (comment_line)
    (comment_line)
    (comment_line))
  (paragraph
    (text_with_inlines
      (text_segment))))
