================================================================================
Basic comparison operators
================================================================================

ifeval::['{fooValue}' == 'bar']
Content when condition is true
endif::[]

---

(source_file
  (conditional_block
    (ifeval_block
      directive: (ifeval_open)
      content: (paragraph
        content: (inline_seq_nonempty
          (plain_text)
          (plain_text)
          (plain_text)
          (plain_text)
          (plain_text)))
      end: (endif_directive))))

================================================================================
Numeric comparison
================================================================================

ifeval::[{countTotal} > 5]
endif::[]

---

(source_file
  (conditional_block
    (ifeval_block
      directive: (ifeval_open)
      end: (endif_directive))))

================================================================================
Logical operators
================================================================================

ifeval::[{aValue} && {bValue}]
endif::[]

---

(source_file
  (conditional_block
    (ifeval_block
      directive: (ifeval_open)
      end: (endif_directive))))

================================================================================
Logical NOT operator
================================================================================

ifeval::[!{flagState}]
endif::[]

---

(source_file
  (conditional_block
    (ifeval_block
      directive: (ifeval_open)
      end: (endif_directive))))

================================================================================
Complex arithmetic expression
================================================================================

ifeval::[{xValue} + {yValue} * 2 > 10]
endif::[]

---

(source_file
  (conditional_block
    (ifeval_block
      directive: (ifeval_open)
      end: (endif_directive))))

================================================================================
Grouped expressions with parentheses
================================================================================

ifeval::[({xValue} + {yValue}) * 2 == {resultValue}]
endif::[]

---

(source_file
  (conditional_block
    (ifeval_block
      directive: (ifeval_open)
      end: (endif_directive))))

================================================================================
Boolean literals
================================================================================

ifeval::[true && false]
endif::[]

---

(source_file
  (conditional_block
    (ifeval_block
      directive: (ifeval_open)
      end: (endif_directive))))
